/*
 
Часть 1:
    - Создать базу
    V       - Создание сканера пространства на ресурсы
            - Механика сбора ресурсов
            - Счётчик ресурсов
        - Создать юнитов
            - Механика подбора ресурса 
    V   - Создать спавнер ресурсов
    V       - Создать две точки между которыми будут спавниться ресурсы
    V   - Создать сам ресурс

    Когда дрон достигает ресурса он его подбирает
    Когда получил ресурс то возвращается к базу
    Выгрузить ресурс
    После 3х ресурсов создать нового дрона

 */
